Autodesk.Revit.DB.ExternalResourceLoadData.SetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceReference)
Returns the ExternalResourceReference resulting from this load operation.
Remarks:
This object contains the ExternalResourceReference produced by the loading operation onIExternalResourceServer.
resourceRef:
A reference to an ExternalResourceReference object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadData.#ctor(Autodesk.Revit.DB.ExternalResourceLoadData)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015